org-publish.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-24 Tue 13:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Publish Github Pages via Org Mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nan Jun Jie" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a> | 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Publish Github Pages via Org Mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgae3f0af">Customization</a></li>
<li><a href="#orgbe5c9d8">Get Css and Fonts</a></li>
</ul>
</div>
</div>
<p>
Now switched from <a href="https://jekyllrb.com/">Jekyll</a>, <a href="https://gohugo.io/">Hugo</a> to Emacs Org Publish.
</p>

<div id="outline-container-orgae3f0af" class="outline-2">
<h2 id="orgae3f0af">Customization</h2>
<div class="outline-text-2" id="text-orgae3f0af">
<p>
First we need to customize variable <code>org-publish-project-alist</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #bdb76b;">"blog"</span>
 <span style="color: #b0c4de;">:base-directory</span> <span style="color: #bdb76b;">"."</span>
 <span style="color: #b0c4de;">:publishing-directory</span> <span style="color: #bdb76b;">"."</span>
 <span style="color: #b0c4de;">:base-extension</span> <span style="color: #bdb76b;">"org"</span>
 <span style="color: #b0c4de;">:recursive</span> t
 <span style="color: #b0c4de;">:publishing-function</span> org-html-publish-to-html
 <span style="color: #b0c4de;">:headline-levels</span> 4
 <span style="color: #b0c4de;">:auto-preamble</span> t
 <span style="color: #b0c4de;">:section-numbers</span> nil
 <span style="color: #b0c4de;">:makeindex</span> nil
 <span style="color: #b0c4de;">:html-head-include-scripts</span> nil
 <span style="color: #b0c4de;">:html-head-include-default-style</span> nil
 <span style="color: #b0c4de;">:auto-sitemap</span> t
 <span style="color: #b0c4de;">:sitemap-filename</span> <span style="color: #bdb76b;">"index.org"</span>
 <span style="color: #b0c4de;">:sitemap-title</span> <span style="color: #bdb76b;">"Thatched Cottage"</span>
 <span style="color: #b0c4de;">:sitemap-sort-files</span> anti-chronologically
 <span style="color: #b0c4de;">:sitemap-format-entry</span> org-publish-sitemap-time-entry
 <span style="color: #b0c4de;">:html-postamble</span> nil)
</pre>
</div>

<p>
My <code>sitemap-format-entry</code>, add timestamp before the sitemap entry:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffffff;">defun</span> <span style="color: #98fb98;">org-publish-sitemap-time-entry</span> (entry style project)
  (format <span style="color: #bdb76b;">"%s %s"</span>
          (format-time-string
           <span style="color: #bdb76b;">"[%Y-%m-%d %a %H:%s]"</span>
           (org-publish-find-date entry project))
          (org-publish-sitemap-default-entry entry style project)))
</pre>
</div>

<p>
Set <code>org-html-head</code> to(<code>customize-variable org-html-head</code>) to use my
<code>org.css</code>:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #98fb98;">link</span> <span style="color: #9acd32;">rel</span>=<span style="color: #bdb76b;">"stylesheet"</span> <span style="color: #9acd32;">type</span>=<span style="color: #bdb76b;">"text/css"</span> <span style="color: #9acd32;">href</span>=<span style="color: #bdb76b;">"css/org.css"</span> /&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe5c9d8" class="outline-2">
<h2 id="orgbe5c9d8">Get Css and Fonts</h2>
<div class="outline-text-2" id="text-orgbe5c9d8">
<p>
I must put the fonts local because most people living here can not
access google fonts service directly.  Get the css and fonts from
Below:
</p>

<ol class="org-ol">
<li><a href="./css/org.css">org.css</a>,</li>
<li><a href="./css/fonts.css">fonts.css</a>,</li>
<li><a href="./css/DroidSans.ttf">DroidSans.ttf</a>,</li>
<li><a href="./css/DroidSansMono.ttf">DroidSansMono.ttf</a>,</li>
<li><a href="./css/DroidSerif.ttf">DroidSerif.ttf</a>.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
